package com.example.daggerpizzeria.example_7

import androidx.appcompat.app.AppCompatActivity

class MainActivity7 : AppCompatActivity()

/*
Example_6 (Отдельные экземпляры):

Внедрение отдельных экземпляров с квалификаторами
Каждая пицца инжектится индивидуально
Статическое определение конкретных пицц

Фиксированный набор зависимостей
Четко определенные роли
Простые зависимости


Example_7 (Мультибиндинг):

Внедрение коллекции (Set) пицц
Все пиццы собираются в единый Set
Динамическое добавление пицц

Динамический набор объектов
Необходимость группировки
Сложные архитектуры
Плагинные системы

 */