package com.example.daggerpizzeria.example_9

import androidx.appcompat.app.AppCompatActivity

class MainActivity9 : AppCompatActivity()

/*
Ключевые особенности Example_9

Простейший пример внедрения зависимостей
Без дополнительных модулей
Прямое внедрение конкретного класса
Отличия от предыдущих примеров:
Нет явных модулей
Используется автоматическое создание зависимостей
Внедряется конкретный класс (HawaiianPizzaImpl)

Особенности:

Аннотация @Inject в конструкторе
Простой механизм создания зависимостей
Автоматическое разрешение зависимостей Dagger

 */